{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,2,2,1025],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":5,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2,2],"strides":[2,2],"padding":"valid","data_format":"channels_first","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU1","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU1",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU2","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU2",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":4100,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU3","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU3","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[2,2,1025],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU3",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["reshape_Reshape1",0,0]]},"keras_version":"tfjs-layers 1.1.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[2,2,2,5],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[2560,512],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[512,4100],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[4100],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[512],"dtype":"float32"}]}]}